/**
 * इस दस्तावेज़ में वह शब्द हैं जिनमे 
 * अनुस्वार (बिंदु), अनुनासिक (चंद्रबिंदु)
 * और नुक़्ता का प्रयोग नहीं होता। 
 */
module.exports.MATRAO_WALE_SHABD = [
    
    // अंत में मात्राओं वाले शब्द
    {
        shabd: 'का',
        vichhed: ['क्', 'आ']
    },
    {
        shabd: 'मे',
        vichhed: ['म्', 'ए']
    },
    {
        shabd: 'भी',
        vichhed: ['भ्', 'ई']
    },
    {
        shabd: 'और',
        vichhed: ['औ', 'र्', 'अ']
    },
    {
        shabd: 'होता',
        vichhed: ['ह्', 'ओ', 'त्', 'आ']
    },

    //  स्वर से शुरू होने वाले शब्द
    {
        shabd: 'ऋषि',
        vichhed: ['ऋ', 'ष्', 'इ']
    },
    {
        shabd: 'अनार',
        vichhed: ['अ', 'न्', 'आ', 'र्', 'अ']
    },
    {
        shabd: 'इमली',
        vichhed: ['इ', 'म्', 'अ', 'ल्', 'ई']
    },
    {
        shabd: 'ओखली',
        vichhed: ['ओ', 'ख्', 'अ', 'ल्', 'ई']
    },
    {

        shabd: 'अनुस्वार',
        vichhed: [
            'अ', 'न्', 'उ',
            'स्', 'व्', 'आ',
            'र्', 'अ'
        ]
    },
    {

        shabd: 'अनुनासिक',
        vichhed: [
            'अ', 'न्', 'उ',
            'न्', 'आ', 'स्',
            'इ', 'क्', 'अ'
        ]
    },
    {

        shabd: 'अम्ब्रेला',
        vichhed: [
            'अ', 'म्', 'ब्',
            'र्', 'ए', 'ल्',
            'आ'
        ]
    },
    {
        shabd: 'आउल',
        vichhed: ['आ', 'उ', 'ल्', 'अ']
    },

    //  स्वर से अंत होने वाले शब्द
    {
        shabd: 'कमाओ',
        vichhed: ['क्', 'अ', 'म्', 'आ', 'ओ']
    },
    {
        shabd: 'जाओ',
        vichhed: ['ज्', 'आ', 'ओ']
    },
    {
        shabd: 'गाइए',
        vichhed: ['ग्', 'आ', 'इ', 'ए']
    },

    //  वयंजन से शुरू होने वाले शब्द
    {
        shabd: 'जिनमे',
        vichhed: ['ज्', 'इ', 'न्', 'अ', 'म्', 'ए']
    },
    {

        shabd: 'कबूतर',
        vichhed: [
            'क्', 'अ', 'ब्',
            'ऊ', 'त्', 'अ',
            'र्', 'अ'
        ]
    },
    {
        shabd: 'बकरी',
        vichhed: ['ब्', 'अ', 'क्', 'अ', 'र्', 'ई']
    },
    {
        shabd: 'ठठेरा',
        vichhed: ['ठ्', 'अ', 'ठ्', 'ए', 'र्', 'आ']
    },
    {

        shabd: 'खरगोश',
        vichhed: [
            'ख्', 'अ', 'र्',
            'अ', 'ग्', 'ओ',
            'श्', 'अ'
        ]
    },
    {
        shabd: 'गमला',
        vichhed: ['ग्', 'अ', 'म्', 'अ', 'ल्', 'आ']
    },

    //  संयुक्त व्यंजन वाले शब्द
    {

        shabd: 'सम्मिलित',
        vichhed: [
            'स्', 'अ', 'म्',
            'म्', 'इ', 'ल्',
            'इ', 'त्', 'अ'
        ]
    },
    {

        shabd: 'त्रिशूल',
        vichhed: [
            'त्', 'र्', 'इ',
            'श्', 'ऊ', 'ल्',
            'अ'
        ]
    },
    {
        shabd: 'श्रृन्गार',
        vichhed: [
            'श्', 'र्', 'ऋ',
            'न्', 'ग्', 'आ',
            'र्', 'अ'
        ]
    },

    //  संयुक्त अक्षर वाले शब्द
    {
        shabd: 'वर्षा',
        vichhed: ['व्', 'अ', 'र्', 'ष्', 'आ']
    },
    {
        shabd: 'ग्रेप्स',
        vichhed: ['ग्', 'र्', 'ए', 'प्', 'स्', 'अ']
    },
    {
        shabd: 'मैन्गो',
        vichhed: ['म्', 'ऐ', 'न्', 'ग्', 'ओ']
    },
    {
        shabd: 'प्रयोग',
        vichhed: [
            'प्', 'र्', 'अ',
            'य्', 'ओ', 'ग्',
            'अ'
        ]
    },

    //  द्वित्व व्यंजन वाले शब्द
    {
        shabd: 'लट्टू',
        vichhed: ['ल्', 'अ', 'ट्', 'ट्', 'ऊ']
    },
    {
        shabd: 'उल्लू',
        vichhed: ['उ', 'ल्', 'ल्', 'ऊ']
    },
    {
        shabd: 'उच्चारण',
        vichhed: [
            'उ', 'च्', 'च्',
            'आ', 'र्', 'अ',
            'ण्', 'अ'
        ]
    }
]
