module.exports.MATRAHIN_SHABD = [
    //  स्वर से शुरू होने वाले शब्द।
    {
        sabdh: 'अस्त',
        vichhed: ['अ', 'स्', 'त्', 'अ']
    },
    {

        sabdh: 'औरत',
        vichhed: ['औ', 'र्', 'अ', 'त्', 'अ']
    },
    {

        sabdh: 'ऐनक',
        vichhed: ['ऐ', 'न्', 'अ', 'क्', 'अ']
    },
    {
        sabdh: 'ईक',
        vichhed: ['ई', 'क्', 'अ']
    },
    {
        sabdh: 'एक',
        vichhed: ['ए', 'क्', 'अ']
    },
    {
        sabdh: 'ऊन',
        vichhed: ['ऊ', 'न्', 'अ']
    },
    //  स्वर से अंत होने वाले शब्द।
    {
        sabdh: 'गए',
        vichhed: ['ग्', 'अ','ए']
    },
    {
        sabdh: 'आओ',
        vichhed: ['आ', 'ओ']
    },
    {
        sabdh: 'ओ',
        vichhed: ['ओ']
    },
    {
        sabdh: 'आ',
        vichhed: ['आ']
    },

    //  वयंजन से शुरू होने वाले शब्द।
    {
        sabdh: 'कमल',
        vichhed: ['क्', 'अ', 'म्', 'अ', 'ल्', 'अ']
    },
    {
        sabdh: 'कथन',
        vichhed: ['क्', 'अ', 'थ्', 'अ', 'न्', 'अ']
    },
    {
        sabdh: 'कल',
        vichhed: ['क्', 'अ', 'ल्', 'अ']
    },
    {
        sabdh: 'खल',
        vichhed: ['ख्', 'अ', 'ल्', 'अ']
    },
    {
        sabdh: 'तरह',
        vichhed: ['त्', 'अ', 'र्', 'अ', 'ह्', 'अ']
    },
    {
        sabdh: 'सब',
        vichhed: ['स्', 'अ', 'ब्', 'अ']
    },
    {
        sabdh: 'यह',
        vichhed: ['य्', 'अ', 'ह्', 'अ']
    },
    {
        sabdh: 'वह',
        vichhed: ['व्', 'अ', 'ह्', 'अ']
    },
    {
        sabdh: 'रस',
        vichhed: ['र्', 'अ', 'स्', 'अ']
    },
    {
        sabdh: 'जग',
        vichhed: ['ज्', 'अ', 'ग्', 'अ']
    },
    {

        sabdh: 'थरमस',
        vichhed: [
            'थ्', 'अ', 'र्',
            'अ', 'म्', 'अ',
            'स्', 'अ'
        ]
    },
    {
        sabdh: 'नल',
        vichhed: ['न्', 'अ', 'ल्', 'अ']
    },
    {
        sabdh: 'फल',
        vichhed: ['फ्', 'अ', 'ल्', 'अ']
    },
    {
        sabdh: 'रथ',
        vichhed: ['र्', 'अ', 'थ्', 'अ']
    },
    {
        sabdh: 'वक',
        vichhed: ['व्', 'अ', 'क्', 'अ']
    },
    {

        sabdh: 'शलगम',

        vichhed: ['श्', 'अ', 'ल्', 'अ', 'ग्', 'अ', 'म्', 'अ']
    },

    //  संयुक्त व्यंजन वाले शब्द।
    {
        sabdh: 'यज्ञ',
        vichhed: ['य्', 'अ', 'ज्', 'ञ्', 'अ']
    },
    {
        sabdh: 'कक्ष',
        vichhed: ['क्', 'अ', 'क्', 'ष्', 'अ']
    },
    {
        sabdh: 'क्षम',
        vichhed: ['क्', 'ष्', 'अ', 'म्', 'अ']
    },

    //  संयुक्त अक्षर वाले शब्द।
    {
        sabdh: 'अध्यन',
        vichhed: ['अ', 'ध्', 'य्', 'अ', 'न्', 'अ']
    },
    {
        sabdh: 'वर्ण',
        vichhed: ['व्', 'अ', 'र्', 'ण्', 'अ']
    },
    {
        sabdh: 'शब्द',
        vichhed: ['श्', 'अ', 'ब्', 'द्', 'अ']
    },
    {
        sabdh: 'व्यक्त',
        vichhed: ['व्', 'य्', 'अ', 'क्', 'त्', 'अ']
    },
    {
        sabdh: 'द्रव्य',
        vichhed: ['द्', 'र्', 'अ', 'व्', 'य्', 'अ']
    },
    {
        sabdh: 'वक्त',
        vichhed: ['व्', 'अ', 'क्', 'त्', 'अ']
    },
    {
        sabdh: 'स्वर',
        vichhed: ['स्', 'व्', 'अ', 'र्', 'अ']
    },
    {
        sabdh: 'सप्त',
        vichhed: ['स्', 'अ', 'प्', 'त्', 'अ']
    },

    //  द्वित्व व्यंजन वाले शब्द।
    {
        sabdh: 'चम्मच',
        vichhed: [
            'च्', 'अ', 'म्',
            'म्', 'अ', 'च्',
            'अ'
        ]
    },
    {
        sabdh: 'ढक्कन',
        vichhed: [
            'ढ्', 'अ', 'क्',
            'क्', 'अ', 'न्',
            'अ'
        ]
    },
    {
        sabdh: 'बत्तक',
        vichhed: [
            'ब्', 'अ', 'त्',
            'त्', 'अ', 'क्',
            'अ'
        ]
    },
    {
        sabdh: 'शज्जन',
        vichhed: [
            'श्', 'अ', 'ज्',
            'ज्', 'अ', 'न्',
            'अ'
        ]
    },
    {
        sabdh: 'टक्कर',
        vichhed: [
            'ट्', 'अ', 'क्',
            'क्', 'अ', 'र्',
            'अ'
        ]
    }
];